snlkuharlocal/src/DataProcessors/ОбработкаРегистраСостоянияДокументов/ОбработкаРегистраСостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаРегистраСостоянияДокументов</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СостояниеДокументов/СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеДокументов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.УслугиСтороннихОрганизаций</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУзлаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЖурналРегистрации/ЖурналРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналРегистрации</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изменения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияШапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияТЧ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостояниеДокументов/СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеДокументов</name>
  <enumValues>
    <name>НеВыписаны</name>
  </enumValues>
  <enumValues>
    <name>Выписаны</name>
  </enumValues>
  <enumValues>
    <name>ВыписаныПовторно</name>
  </enumValues>
  <enumValues>
    <name>Получены</name>
  </enumValues>
  <enumValues>
    <name>ПолученыСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСумма</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСуммаСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ОшибкиОформления</name>
  </enumValues>
  <enumValues>
    <name>ПолученоИзображение</name>
  </enumValues>
  <enumValues>
    <name>СканСОшибками</name>
  </enumValues>
  <enumValues>
    <name>Проверены</name>
  </enumValues>
  <enumValues>
    <name>ГотовыКОтправкеВОФис</name>
    <comment>готов к отправке в офис из удаленного подразделения</comment>
  </enumValues>
  <enumValues>
    <name>ПолученДокументЗаместитель</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
    <comment>Документ с изменениями, сданный на склад для создания рекламации</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленВОфис</name>
    <comment>Оригинал отправлен в офис по письменному запросу</comment>
  </enumValues>
  <enumValues>
    <name>ВозвращенВАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВПРО</name>
  </enumValues>
  <enumValues>
    <name>ВнесеныИзменения</name>
  </enumValues>
  <enumValues>
    <name>ПолученыВФилиале</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуютВосстановитьНеВозможно</name>
  </enumValues>
  <enumValues>
    <name>ПоДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ПодписанВЭДО</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ОбработкаРегистраСостоянияДокументов/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостояниеДокументов.Документ КАК Документ,
	|	СостояниеДокументов.КодУзла,
	|	СостояниеДокументов.Состояние,
	//крохин начало 02.09.2013
	|	СостояниеДокументов.ДатаИзменения,
	//крохин конец 02.09.2013
	|	СостояниеДокументов.Автор,
	|	СостояниеДокументов.КодУзлаПолучателя
	|ИЗ
	|	РегистрСведений.СостояниеДокументов КАК СостояниеДокументов
	|ГДЕ
	|	СостояниеДокументов.КодУзлаПолучателя = &КодУзлаПолучателя
	|	И НЕ СостояниеДокументов.Отработана
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("КодУзлаПолучателя",ПараметрыСеанса.ЭтотУзел.Код);
	Выборка = Запрос.Выполнить().Выбрать();
	Н = 0;
	//крохин начало 11.08.2013
	ЗаписатьВЛог("ИзменениеСостоянияПервичныхДокументов","Количество документов: "+Выборка.Количество(),,,);
	//крохин конец 11.08.2013
	
	Пока Выборка.Следующий() Цикл
		Н = Н+1;
		Попытка    //на случай отсутствия объекта в базе
			Документ = Выборка.Документ.ПолучитьОбъект();
			//крохин начало 18.09.2013
			Если Документ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			//крохин конец 18.09.2013
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если Ложь Тогда 
			Документ = Документы.РасходнаяНакладная.НайтиПоНомеру("").ПолучитьОбъект();
		КонецЕсли;
		//крохин начало 11.08.2013
		//Документ.УстановитьСостояниеДокументов(Выборка.Состояние,Выборка.КодУзла);
		//крохин начало 02.09.2013
		//проверяем по журналу изменений
		//Если ПолучитьНомерСостояния(Документ.СостояниеДокументов) <= ПолучитьНомерСостояния(Выборка.Состояние) Тогда
		ТекстСсылки=Строка(Документ.Ссылка.УникальныйИдентификатор());
		ТаблицаСтатусов=ПолучениеСтатусов(ТекстСсылки,Документ.Ссылка,Выборка.ДатаИзменения);
		//крохин конец 02.09.2013	  

		Если Документ.СостояниеДокументов <> Выборка.Состояние Тогда
		//крохин начало 02.09.2013
		//Документ.УстановитьСостояниеДокументов(Выборка.Состояние,Выборка.КодУзла);
		Если ТаблицаСтатусов = Неопределено Тогда
		Документ.УстановитьСостояниеДокументов(Выборка.Состояние,Выборка.КодУзла);	
		КонецЕсли;
		//крохин конец 02.09.2013	
							   
		КонецЕсли;				   
	
	НЗ = РегистрыСведений.СостояниеДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.КодУзлаПолучателя.Установить(ПараметрыСеанса.ЭтотУзел.Код,Истина);
	НЗ.Отбор.КодУзла.Установить(Выборка.КодУзла,Истина);
	НЗ.Отбор.Документ.Установить(Документ.Ссылка,Истина);
	Запись = НЗ.Добавить();
	Запись.Регистратор = Документ.Ссылка;
	Запись.Состояние = Выборка.Состояние;
	Запись.Автор = Выборка.Автор;
	Запись.КодУзлаПолучателя = ПараметрыСеанса.ЭтотУзел.Код;
	Запись.Документ = Документ.Ссылка;
	запись.КодУзла =  Выборка.КодУзла;
	Запись.Отработана = Истина;
	//крохин начало 02.09.2013
	запись.ДатаИзменения = Выборка.ДатаИзменения;
	//крохин конец 02.09.2013
	НЗ.Записать();
	//крохин конец 11.08.2013
	#Если Клиент Тогда
		Сообщить(Н);
	#КонецЕсли
	//крохин начало 11.08.2013  
	Если Н > 1 И Цел((Н-1)/100) = (Н-1)/100 Тогда
		ЗаписатьВЛог("ИзменениеСостоянияПервичныхДокументов","Обработано документов: "+(Н-1),,,);
	КонецЕсли;
	//крохин конец 11.08.2013
КонецЦикла;
#Если Клиент Тогда
	Сообщить("обработка завершена");
#КонецЕсли
//крохин начало 11.08.2013
ЗаписатьВЛог("ИзменениеСостоянияПервичныхДокументов","Обработка завершена .Обработано документов: "+(Н-1),,,);
//крохин конец 11.08.2013
КонецПроцедуры

Функция ПолучитьНомерСостояния(Состояние)
Если Состояние = Перечисления.СостояниеДокументов.НеВыписаны Тогда
	Возврат 0;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.Выписаны Тогда
	возврат 1;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ВыписаныПовторно Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.Получены Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученыСИзменениями Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПодтвержденаСумма Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПодтвержденаСуммаСИзменениями Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ОшибкиОформления Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученоИзображение Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.Проверены Тогда
	возврат 5;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ГотовыКОтправкеВОФис Тогда
	возврат 5;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученДокументЗаместитель Тогда
	возврат 3;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.НаСкладе Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ОтправленВОфис Тогда
	возврат 6;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ВозвращенВАрхив Тогда
	возврат 6;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ОтправленВПРО Тогда
	возврат 6;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ВнесеныИзменения Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученыВФилиале Тогда
	возврат 6;
КонецЕсли;
Возврат 0;

КонецФункции


функция ПолучениеСтатусов(ТекстСсылки,накладная,ДатаИзменения)
	
	отбор= новый Структура;
	отбор.Вставить("реквизит","СостояниеДокументов");
	
	запрос= Новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	ЖурналРегистрации.Изменения,
	             |	ЖурналРегистрации.Дата КАК Дата,
	             |	ЖурналРегистрации.Пользователь,
	             |	ЖурналРегистрации.НомерСообщения
	             |ИЗ
	             |	РегистрСведений.ЖурналРегистрации КАК ЖурналРегистрации
	             |ГДЕ
	             |	ЖурналРегистрации.ТекстСсылки = &ТекстСсылки
				 //крохин начало 02.09.2013
	             |	И ЖурналРегистрации.Дата > &ДатаИзменения
				 //крохин конец 02.09.2013
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Дата УБЫВ
	             |АВТОУПОРЯДОЧИВАНИЕ";
	запрос.УстановитьПараметр("ТекстСсылки",ТекстСсылки);
		 //крохин начало 02.09.2013
	             запрос.УстановитьПараметр("ДатаИзменения",ДатаИзменения);
				 //крохин конец 02.09.2013

	результат=запрос.Выполнить().Выгрузить();
	
	сч=0;
	
	
	для каждого СтрокаРезультата из результат цикл
		если СтрокаРезультата.изменения.получить()= Неопределено тогда
			продолжить;
		КонецЕсли;
		Если СтрокаРезультата.НомерСообщения <> 0 Тогда
			Продолжить;
		КонецЕсли;

		//Кухарь 22.02.19 начало
		//Изменения=ЗначениеИзСтрокиВнутр(СтрокаРезультата.изменения.получить()).Реквизиты;
		
		если  СтрокаРезультата.изменения.получить()="" тогда
			Продолжить;
		иначе
			Изменения=ЗначениеИзСтрокиВнутр(СтрокаРезультата.изменения.получить()).Реквизиты;
		КонецЕсли;
		//Кухарь 22.02.19 конец		 
 

		НаличиеСостояний=Изменения.найтистроки(отбор);
		
		если НаличиеСостояний.количество()=0 тогда
			продолжить;
			
		иначеесли НаличиеСостояний.количество()=1 тогда
			
			ТаблицаСтатусов = Новый Структура;
			ТаблицаСтатусов.Вставить("Документ",накладная.ссылка);
			ТаблицаСтатусов.Вставить("ДатаИзменения",СтрокаРезультата.дата);
			ТаблицаСтатусов.Вставить("Состояние",НаличиеСостояний.получить(0).получить(2));
			Возврат ТаблицаСтатусов;	
		иначе 
			//Сообщить("ошибка алгоритма, обратитесь в IT отдел");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;			
	
КонецФункции
